scrapy/deploy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-13 二 10:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>scrapy 爬虫部署</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">scrapy 爬虫部署</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga1a6005">1. 概述</a></li>
<li><a href="#org87f67bc">2. 从脚本启动爬虫</a></li>
<li><a href="#org2cae0a5">3. Scrapyd</a></li>
<li><a href="#org50bbdb6">4. Scrapyd-client</a></li>
<li><a href="#org4fc93a8">5. Scrapyrt</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga1a6005" class="outline-2">
<h2 id="orga1a6005"><span class="section-number-2">1</span> 概述</h2>
</div>

<div id="outline-container-org87f67bc" class="outline-2">
<h2 id="org87f67bc"><span class="section-number-2">2</span> 从脚本启动爬虫</h2>
<div class="outline-text-2" id="text-2">
<p>
之前都是从命令行启动爬虫，但有时候需要从脚本启动爬虫，比如爬虫项目是另外一个项目的子项目。具体方法参见<a href="https://doc.scrapy.org/en/latest/topics/practices.html">Run Scrapy from a script</a> 。
</p>
</div>
</div>

<div id="outline-container-org2cae0a5" class="outline-2">
<h2 id="org2cae0a5"><span class="section-number-2">3</span> Scrapyd</h2>
<div class="outline-text-2" id="text-3">
<p>
可以通过定时任务让爬虫程序定时执行。但是如果有多个爬虫，就需要并行执行来提高效率。
</p>

<p>
scrapy 提供了更好的方式来部署爬虫：<a href="https://scrapyd.readthedocs.io/en/latest/index.html">scrapyd</a>。  scrapyd 是 demon 程序，提供了 HTTP 接口对爬虫进行方便的部署、运行和监控。。
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo pip3 install scrapyd
</pre>
</div>
</div>
</div>

<div id="outline-container-org50bbdb6" class="outline-2">
<h2 id="org50bbdb6"><span class="section-number-2">4</span> Scrapyd-client</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://github.com/scrapy/scrapyd-client">scrapyd-client </a>但是提供了更方便的操作方式。
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo pip3 install --upgrade git+https://github.com/scrapy/scrapyd-client
</pre>
</div>
<p>
注意：使用 <code>pip3 install scrapyd-client</code> 安装的程序将会在命令行找不到 <code>scrapyd-client</code> 命令，所以需要用 github 代码进行更新升级。
</p>

<p>
现在进入 scrapy.cfg 目录下（爬虫的 root 目录）：
</p>
<div class="org-src-container">
<pre class="src src-sh">tutorial$ scrapyd-deploy
</pre>
</div>

<p>
scrapyd 接口返回如下信息：
</p>
<pre class="example">
Packing version 1517472918
Deploying to project "tutorial" in http://localhost:6800/addversion.json
Server response (200):
{"project": "tutorial", "spiders": 2, "node_name": "lsl-ThinkPad-X1-Carbon-5th", "status": "ok", "version": "1517472918"}
</pre>

<p>
上述信息说明：名为 tutorial 的 project 部署成功，它有两个 spider，具体看下：
</p>
<div class="org-src-container">
<pre class="src src-sh">scrapyd-client spiders -p tutorial
</pre>
</div>
<p>
正式代码中实现的两个 spider。
</p>
<pre class="example">
tutorial:
  author
  quotes
</pre>
<p>
运行 quotes 的爬虫：
</p>
<div class="org-src-container">
<pre class="src src-sh">scrapyd-client schedule -p tutorial quotes
</pre>
</div>

<p>
scrapyd-client 并没有完整的支持 scrapyd 所有 HTTP 接口，比如查询爬虫进度的接口：
</p>
<div class="org-src-container">
<pre class="src src-sh">curl http://localhost:6800/listjobs.json?<span style="color: #ff8700;">project</span>=tutorial | python -m json.tool
</pre>
</div>
</div>
</div>
<div id="outline-container-org4fc93a8" class="outline-2">
<h2 id="org4fc93a8"><span class="section-number-2">5</span> Scrapyrt</h2>
<div class="outline-text-2" id="text-5">
<p>
Scrapyrt 为 Scrapy 提供了一个调度的 HTTP 接口，有了它，我们就不需要再执行 Scrapy 命令而是通过请求一个 HTTP 接口来调度 Scrapy 任务了 。Scrapyrt 比 Scrapyd 更轻量，如果不需要分布式多任务的话，可以简单使用 Scrapyrt 实现远程 Scrapy 任务的调度。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-08-13 二 10:43</p>
<p class="validation"></p>
</div>
</body>
</html>
